_site/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>cfclrk</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">cfclrk</h1>
</header>
<div id="outline-container-org9b95fc3" class="outline-2">
<h2 id="org9b95fc3"><a href="#org9b95fc3">Hello</a></h2>
<div class="outline-text-2" id="text-org9b95fc3">
<p>
I am Chris! I like family time, hugging my baby, tinkering with Emacs,
drinking beer, and playing sports &#x2013; simultaneously.
</p>

<p>
Find me on:
</p>

<ul class="org-ul">
<li><a href="https://github.com/cfclrk">GitHub</a></li>
<li><a href="https://www.linkedin.com/in/cfclrk/">LinkedIn</a></li>
<li><a href="https://twitter.com/cfclrk">Twitter</a></li>
</ul>

<p>
And here is <a href="https://github.com/cfclrk/resume/blob/master/resume.pdf">my résumé</a>.
</p>

<p>
To contact me, email me at <code>cfclrk@gmail.com</code>, especially if you have comments
or advice about anything on this site!
</p>
</div>
</div>

<div id="outline-container-org0bb71d0" class="outline-2">
<h2 id="org0bb71d0"><a href="#org0bb71d0">About this Site</a></h2>
<div class="outline-text-2" id="text-org0bb71d0">
<p>
This site is an HTML export of some of my <a href="https://orgmode.org/">org-mode</a> notes. Org-mode is a
<a href="https://en.wikipedia.org/wiki/Literate_programming">literate-programming</a> environment; within Emacs I can execute the code blocks
on this site interactively.
</p>

<p>
The source code is spread out among a couple personal repos: <a href="https://github.com/cfclrk/articles">articles</a>,
<a href="https://github.com/cfclrk/cloudformation">cloudformation</a>, <a href="https://github.com/cfclrk/site">site</a>, <a href="https://github.com/cfclrk/cfclrk.github.io">cfclrk.github.io</a>, and some org-mode configuration in
<a href="https://github.com/cfclrk/dotfiles/blob/master/emacs_cfclrk/cfclrk_org.el">dotfiles</a>.
</p>
</div>
</div>
</div>
</body>
</html>
